<PAD>
<UNK>
<EOS>
the
.
and
walk
turn
left
right
to
go
of
,
stop
on
room
stairs
into
door
down
in
wait
through
a
at
past
you
hallway
doorway
straight
bedroom
exit
table
enter
then
up
bathroom
with
your
towards
take
front
hall
kitchen
out
next
forward
around
by
near
first
doors
continue
bed
steps
top
end
chairs
area
dining
until
make
there
once
pass
wall
outside
head
that
open
glass
living
leave
bottom
couch
two
chair
inside
across
toward
just
side
when
get
white
ahead
double
before
sink
reach
second
from
large
step
staircase
between
after
pool
way
fireplace
closet
stand
are
passed
rug
is
house
going
it
behind
entrance
set
counter
move
all
wooden
red
walking
patio
'
landing
floor
other
corner
small
office
sitting
black
painting
keep
mirror
desk
facing
again
three
along
bar
another
middle
slight
archway
carpet
couches
passing
laundry
slightly
stair
leading
blue
see
follow
window
onto
entryway
long
round
an
foot
last
hard
will
brown
plant
building
stopping
sliding
island
be
piano
few
balcony
wood
opening
directly
one
railing
tv
away
sign
flight
beside
sofa
far
face
tub
using
proceed
entry
bench
refrigerator
back
this
opposite
toilet
shower
windows
third
"
picture
tables
light
where
vase
under
sharp
-
ll
massage
leads
as
foyer
cabinet
over
walkway
entering
main
stove
green
here
degrees
corridor
cross
stairway
path
four
statue
downstairs
stairwell
lamp
bathtub
s
veer
porch
big
lounge
upstairs
art
television
dinning
fridge
hanging
coffee
immediate
arched
potted
them
which
re
has
leather
immediately
tile
more
so
garage
climb
exercise
edge
home
grey
marble
beds
stools
wine
base
pictures
center
banister
2
standing
flowers
start
stone
can
plants
dresser
pillar
clock
shelves
case
deck
stepping
tree
nearest
very
mat
shelf
paintings
some
looking
cabinets
arch
off
empty
walls
hand
short
halfway
bookshelf
direction
chandelier
oven
water
circular
travel
closest
machine
pantry
feet
/
though
sinks
should
heading
have
metal
circle
above
narrow
christmas
bookcase
sculpture
screen
fourth
washer
framed
yellow
dryer
threshold
thermostat
furniture
switch
couple
fire
come
pillars
level
purple
exiting
five
gym
rope
brick
about
theater
keeping
elevator
column
stay
gray
sauna
descend
little
outdoor
via
indoors
taking
turning
reaching
frame
columns
library
display
lobby
sets
doorways
desks
for
sofas
rest
closed
tall
those
need
artwork
ninety
3
spiral
bath
intersection
french
ceiling
but
orange
following
hot
study
both
striped
half
gate
ottoman
he
180
pathway
bookshelves
tiled
seating
treadmill
rocking
benches
flower
moving
gold
pink
fountain
wicker
square
locker
ping
pong
washing
restroom
rail
now
extinguisher
seat
bear
switches
stool
beige
suite
u
destination
lead
carpeted
reception
dark
single
fitness
located
while
animal
equipment
against
90
2nd
ve
each
man
book
nightstand
pot
covered
(
leftmost
guitar
silver
partition
ascend
welcome
)
work
lockers
mosaic
vases
zebra
upwards
bike
reached
flooring
pews
armchairs
counters
grass
storage
conference
curved
piece
arm
farthest
not
rack
den
platform
console
ladder
finish
soon
space
cellar
microwave
ground
quick
degree
built
game
flights
master
hardwood
till
do
en
six
t
cloth
vanity
look
says
curtain
divider
elevators
entered
horse
ropes
parallel
aisle
find
clear
grand
place
bit
drawers
curtains
photos
even
position
phone
jacuzzi
recliner
forwards
mirrors
curve
either
opens
outdoors
row
roped
4
breakfast
close
visible
adjacent
tapestry
concrete
rooms
grill
continuing
giant
beyond
underneath
basket
colored
oval
beaded
o
staircases
dog
planter
locate
ovens
armchair
smaller
fifth
doormat
fan
vent
great
exterior
these
staying
trees
iron
immediatly
length
alongside
drum
arcade
midway
railings
cooler
alcove
sidewalk
tan
utility
frames
shaped
almost
downwards
post
towel
hammock
beach
marked
rectangular
poster
prior
mini
books
pillows
lower
seats
pots
runner
without
like
radiator
machines
..
well
holes
further
panel
part
decoration
ends
candles
towels
leaving
upon
movie
or
photo
faucet
beginning
colorful
entire
rightmost
buffet
arrive
ballroom
portrait
its
barrier
kitchenette
waiting
workout
5
love
turns
box
1
same
rocks
men
yard
heater
placed
countertop
family
passageway
climbing
marilyn
45
footstool
abstract
making
nook
patterned
clockwise
diagonally
several
hang
floors
support
loveseat
design
rock
spa
sectional
board
air
garden
altar
monroe
let
loft
section
floral
meeting
baskets
hit
statues
ornate
old
pattern
mirrored
eye
begin
print
line
guardrail
women
looks
bust
chaise
lamps
recreation
coat
mounted
dressing
checkered
church
wide
wardrobe
dishwasher
frosted
stones
below
angle
sixth
eight
labeled
painted
lattice
computer
sailboat
unfinished
goes
pas
pillow
washroom
3rd
barber
hallways
promptly
girl
wet
floored
blanket
bedrooms
also
basketball
;
starting
flag
decorative
if
arches
sconce
backyard
shoes
meet
swimming
rugs
telephone
nest
bigger
fence
upper
made
trash
many
final
urn
granite
yourself
credenza
beam
descending
tops
tot
full
chest
started
approach
dot
cushioned
court
larger
tiles
dots
still
stall
remaining
lights
alter
velvet
fancy
break
extreme
furthest
drinking
swing
cactus
oriental
opened
veering
cheetah
stars
put
armoire
billiard
our
curio
getting
american
curving
#
thing
chart
archways
interior
arc
night
low
posters
infront
tennis
copy
froward
bridal
loungers
easel
cream
comforter
winding
point
indoor
followed
dogleg
seven
no
woman
walked
dinner
bowl
bin
host
distance
beneath
golden
foosball
folding
arrow
recliners
planters
rounded
clothes
bush
ledge
bushes
star
barstools
curves
backside
swinging
. .
areas
11
panes
current
photographs
children
palm
gallery
holding
please
than
billiards
hutch
pedestal
tablecloth
cushions
bannister
formal
talk
openings
terrace
sit
garbage
hundred
eighty
ball
paper
only
containing
number
plaque
screened
arrangement
pivot
rails
feather
trunk
overlooking
structure
closets
splits
don
entertainment
decorations
flat
filled
mats
antelope
throught
deer
twin
sunken
shelving
lit
changes
settee
ladies
urns
woven
banquet
pew
use
stuffed
bottles
fork
kids
pocket
construction
salon
cupboards
giraffe
fruit
brass
electrical
rear
object
nearby
wreath
atrium
avoid
handle
boxes
change
passage
thought
pole
weight
stained
polka
watermelon
central
topped
letters
steel
globe
violin
dividers
restrooms
drawer
lady
rows
ascending
candle
arrived
jump
view
stationary
faced
finally
block
approximately
treadmills
pair
saxophone
unit
teh
sunset
too
6
bird
doorframe
cement
bathing
reading
people
burgundy
being
powder
butler
fake
doorknob
spot
goal
would
4th
bathrooms
crossing
marbled
bookcases
lines
sides
skin
any
grandfather
pgi
unicycle
high
bedside
gravel
completely
lounging
ship
int
cylinder
mantle
beads
e
paneled
surrounded
portraits
pulp
fiction
lighted
sculptures
horizontal
padded
pause
cow
projector
entrances
reclining
vaulted
intersecting
ten
pig
projection
they
guitars
pendant
outlet
tun
lounger
cases
grate
signs
stepped
plywood
carpeting
theatre
homes
stacked
zebras
son
handrail
thirty
counting
grain
crystal
leopard
car
vertical
halt
media
plate
houseplant
handing
landscape
enerskin
class
playroom
enclosed
ways
shoe
pipes
huge
keyboard
roof
slider
barbecue
elliptical
run
wrap
lawn
dividing
rectangle
diagonal
barn
gone
style
mid
hangings
lots
suitcases
were
throw
new
straw
lips
body
instead
ski
stick
exam
paces
shop
minibar
weird
ceramic
their
paneling
l
pallet
impact
hub
bbq
solid
background
robes
walks
begins
shallow
attic
slats
finished
scenes
meter
meters
tusks
plastic
plaid
entranceway
tight
able
...
written
wash
boat
bare
image
panels
split
stiars
walled
appliances
leaning
drums
twelve
squared
showers
serving
rice
siting
instructions
bunch
tubs
control
exits
dinging
hat
bay
sun
entryways
wheelchair
sop
magazine
closer
hollow
downward
everything
niche
copier
rustic
net
bamboo
similar
lake
boulders
petition
word
pane
candelabra
strait
person
series
diamond
nine
security
extinguishers
backgammon
went
sailboats
smoke
detector
sharply
teddy
dishes
mural
blackboard
scene
hamper
hose
boy
makeup
remainder
longer
cylindrical
anymore
runs
china
curtained
bouquet
tray
station
crab
hockey
fabric
bicycle
downtown
stainless
mountain
plates
scale
letter
advance
dress
map
microwaves
podium
seventh
th
laid
screens
circles
sticking
6th
text
minifridge
einstein
contains
boiler
lined
guest
supplies
fixtures
showing
enters
rafter
meets
medical
twenty
lighting
heads
metre
takes
cover
human
stage
plan
20
having
appears
thru
darker
cord
common
upholstered
buddha
pottery
eating
encounter
lion
workbench
labelled
slatted
sized
flowered
pit
bars
slab
could
popcorn
upward
video
organ
portion
stalls
traveling
guitarist
fireplaces
forty
transparent
remain
quickly
foward
massive
perpendicular
adjoining
really
banisters
aqua
division
motorcycle
branch
urinal
baluster
ones
navigate
most
bridge
racks
want
revolving
except
rotary
birdcage
basement
draped
tank
arms
bottle
native
wiat
wastebasket
exist
surrounding
02
arriving
twice
cardboard
314
flowerbed
reenter
i
lampshade
pieces
direclty
spaces
elephant
thin
liquor
fern
stands
items
wooded
grated
drawing
crossed
rights
aside
bathtubs
whole
showpiece
orient
inset
triangle
posts
child
cowhide
vine
handicap
farm
wing
lefts
pulpit
stanchions
breezeway
opp
extremely
plug
animals
does
boards
recessed
cinema
overhead
opportunity
corners
twelfth
strip
coach
metallic
drawings
words
separating
tanning
futon
rather
nice
extra
possible
hexagon
may
checkerboard
ro
conversational
shape
galley
hear
shag
maroon
player
receptacle
got
urinals
orchids
driveway
workroom
available
sword
fountains
tea
barred
beautiful
squares
music
offices
veranda
semi
cupboard
gated
clay
dual
sports
attached
chrome
correct
intersects
skylight
onward
traverse
tiling
bedspread
form
339
trough
rose
doll
antique
bead
informational
balloons
steam
dolls
balls
walkthrough
prayer
spider
mermaid
rung
beauty
store
nerolie
buck
rotate
stairways
canisters
raised
butlers
barrel
tubes
fur
material
soft
trieste
st
chaises
jog
wrought
canvas
drop
hyena
cushion
odd
jar
thorough
monitor
triptych
pavement
11th
group
ocean
nd
cathedral
cacti
triangular
glasses
exited
fixture
enterance
moose
goright
setting
gilt
things
ventilation
jam
check
wires
7
materials
radio
crosses
statute
wallpaper
stoves
staff
dead
drapery
say
log
whiteboard
camera
hug
identical
continute
turk
striaght
antechamber
eventually
greyish
degress
peice
city
beams
sleeping
char
shuttered
momentum
drinks
multiple
chevron
bag
goodfellas
rod
had
quilt
held
trapdoor
drip
pointing
temperature
food
flanked
different
wheel
doored
bureau
receptionist
pine
daybed
paining
snail
bast
plank
candy
cane
barbers
covering
throuhg
carts
quote
18
:
directions
withe
leg
vestibule
prints
160
fish
plaques
placemat
cigar
done
graphic
sing
allow
pipe
teal
alone
faucets
trashcan
ached
leaf
shrub
dirt
c
hedge
lime
mantel
trimmed
shirts
digital
shrubbery
pointed
printed
patchwork
poolside
dressers
reverse
bags
awning
centerpiece
herringbone
target
decorated
whose
enclosure
wagon
criss
aright
skinny
ottomans
gazebo
read
neighboring
newspaper
tenth
handicapped
blinds
vending
starts
vertically
printer
bearing
lot
residence
handles
carved
houses
vessel
leaded
keys
foreward
30
passes
push
bulletin
chalk
moment
saloon
drawn
hands
crate
seeing
z
seen
young
cars
easle
rightside
motion
hedges
quarter
hats
bananas
tanks
gain
pants
geometric
la
wand
paved
ignore
doorstep
ad
restaurant
becomes
5th
breaker
intersect
04
wlk
sideways
instruction
magazines
oddly
d
bins
oil
chimney
faces
drumset
collection
pop
chandeliers
sheets
cooker
righ
waterfall
barstool
rolls
bistro
street
writing
adjustable
clothed
swirly
dollhouse
paving
tiny
color
jars
rooftop
original
dinette
reddish
tucked
ending
viewing
road
bricks
separate
360
wal
windowed
barroom
359
zigzag
warning
tape
danger
peligro
halls
perfume
chars
backed
headed
stops
business
paint
chessboard
aluminum
stoop
changing
metres
buildings
headboard
victorian
walkout
wat
pail
apples
cannot
pie
umbrella
barricade
goo
instruments
344
know
til
sharper
build
enough
slot
hotel
outhouse
await
river
dispenser
barbeque
york
linen
heating
dome
overlooks
peices
model
club
angling
endtable
leaves
time
connecting
baptismal
units
instrument
graffiti
range
toaster
stanchion
recycling
relaxation
saying
makes
horned
shell
nqhg
sewing
wheels
objects
burst
smallest
daybeds
viaggio
oriente
b
glasstop
chalkboard
abe
lincoln
groom
spiderman
pamphlets
glowing
latticework
buttons
cabin
easy
buiding
story
hairs
pushed
clawfoot
hole
vertices
pub
plunge
sky
fuzzy
footrest
masseuse
ar
studio
blankets
inter
caution
drain
fifteen
piller
kitch
kitten
lighter
alarm
controller
slat
encountered
cookie
waitin
whit
indian
sraight
bulbs
parttion
stuff
pastt
doorwaya
footpath
ulity
pump
wards
ivory
pizza
tri
fold
twisty
curly
platter
counted
pelts
chamber
stairst
patch
stairwells
hold
chain
8
peer
jaguar
quilts
plugged
splash
angels
showroom
extension
fainting
bronze
found
soldier
woodside
ensuite
workspace
mirrow
alcohol
straightly
cut
outs
workshop
nextt
midle
dish
sail
foose
steping
straights
was
sleight
backs
plane
lap
oak
thalgo
insulated
classic
kettle
container
gangway
doorknobs
seated
boating
slabs
crossroads
ride
frida
kahlo
continiue
slim
reflective
bank
" .
highchairs
draining
bowls
structures
mixture
bordering
agian
beers
stet
dinign
order
exactly
shiny
match
bulk
bating
inot
connect
pull
ste
gilded
figure
pillared
sits
canter
kithen
direclly
originally
sheeting
various
wavy
discontinue
courtyard
triple
navy
?
lightswitch
bean
orientation
poker
presentation
slowly
came
opending
proceeding
safari
safair
garment
separates
servers
isle
necks
boundary
trap
frojt
ktichen
upp
posted
rods
poem
halloway
vice
mud
underside
linens
label
bonsais
cloths
basin
birdhouse
press
land
staits
dry
erase
tiered
molded
amazing
inbetween
foom
holder
kithccen
greenish
soaking
latticed
feathers
godfather
135
10
luggage
stored
matthew
tablet
wolf
town
bu
procedure
cluttered
additional
borrom
laptop
duvet
libray
bedrom
pencils
firs
tho
intermediary
therfe
poles
farther
belts
mauve
wildlife
ope
redefine
how
displace
statuette
sill
requires
onc
eyou
david
surfers
refirgerator
ak47
article
bathroomand
forwar
location
copper
dell
livingroom
border
bordered
dock
largest
slate
narrows
boulder
blackened
whirlpool
bye
lioness
lock
assembly
fully
titled
missa
cantata
john
coburn
chinese
lions
thew
paste
squeeze
froom
labebled
bicycles
cooktop
diningroom
wind
encasement
guy
neck
parking
ryan
blair
panting
band
performing
skateboards
polar
beanbag
sunning
steppingstones
midpoint
conitnue
ont
rigvht
slighting
backless
cubical
driftwood
tightrope
cabana
asleep
chruch
lefthand
thorought
321
plain
keypads
modern
xray
nude
cubicles
translucent
spray
booth
golf
encased
arching
lane
religious
figures
dinig
riding
scarf
pc
loveseats
mens
earlier
chess
portable
entrence
divides
adobe
starfish
seashell
tissue
connected
previous
extending
doing
such
avove
lightswitches
desktop
articles
frontier
crowd
imac
cafe
ready
grained
soyunma
odasi
handside
marle
artworks
wire
quilted
egg
photocopier
macine
vineyard
fridgerator
untill
seascape
multicade
topiaries
christian
supper
bookshelft
thats
tail
n
yoga
376
candlesticks
daniel
clothing
artifact
ramp
bumping
poo
pears
headig
dirty
dancing
lengths
knick
knacks
mask
clasping
her
chin
kidney
blonde
bedding
smiling
maker
contunue
clutching
his
k
combination
wingback
mental
formation
photographic
vehicles
watch
relaxing
[
ast
legs
electronic
isn
pianos
eatery
oustide
continued
sections
allows
stariway
knob
sconces
fields
placemats
chritmas
legged
doorstop
boys
furnace
tablets
lighthouse
angled
tale
cooking
charis
overlook
grilling
ornately
churner
etc
rand
colorfully
branches
quarters
option
spherical
wraparound
bypassing
shy
handbags
power
system
transom
ding
supports
bedroomon
fist
joins
unto
kit
bucket
llama
tools
hooks
puppy
shortly
ext
roo
doubles
junction
antler
fishing
driyer
fossilized
colorless
columned
conter
nativity
based
accent
day
lucite
flowerpot
ornament
jade
thourgh
proper
rightward
stripped
towars
cutout
countertops
pregnant
skip
wade
363
ticket
doorsways
grasses
otherwise
products
tabled
hangers
dartboard
bright
play
shade
conditioners
jacket
sheer
youl
countryside
rigth
dirnng
fowards
hoop
ours
murphy
least
beamed
trusses
drying
electric
dooway
hallwayand
oft
dancer
exercising
knights
containers
donut
plantation
cutting
planks
indoorway
atnd
bypass
wolverine
centers
asian
slender
brochures
dull
vear
narrower
commlum
ivy
nature
jaunt
coming
computers
notice
become
cinderblock
05
catcher
ithrough
rowing
photocopy
bedstand
sunsets
figurine
fives
robe
setee
fresh
speaker
palisserie
hvac
module
gap
acting
safety
kid
lilacs
feeding
stump
bycicle
creature
crabs
birds
cups
asking
blocking
holders
walkdown
ninth
se
kiddie
wen
sheepskin
turtle
43
greeted
alps
simply
stripes
spell
comic
treasure
casual
pitcher
cables
taker
beverages
shrubs
wading
307
parlor
op
v
drapes
netting
nave
rooom
al
cart
graphite
9
hurom
apple
glitter
cup
pins
opportunities
, ...",
opposing
taupe
washbasin
shiplapped
oversized
ficus
briefly
roll
endter
eft
mark
perimeter
twp
funky
sweaters
fireplaplace
semicircular
instructed
gazing
opnes
ash
chandileir
choose
billard
faux
orchid
timber
hardware
bad
poodle
warming
splatter
moved
roses
peninsula
north
picnic
intercom
concealed
east
skis
kitty
hinges
merge
swirl
mottled
dotted
peach
starins
met
couche
duck
gong
boats
because
dolly
broom
coiled
painters
painter
tarp
remodeled
carriage
turnstyle
placard
g
siairs
widescreen
height
littler
honeycomb
passe
feature
rockers
crash
overstuffed
later
lefto
enterence
stright
highback
skull
reg
departed
cordless
alcoholic
larch
staright
grid
maltese
oped
service
snack
dispense
burnt
ridge
closes
bikes
swivel
route
andgo
nect
cube
seaing
bahtroom
osb
trolley
ironing
worded
trying
gown
notices
northernmost
fall
bedpost
comprised
edging
hampers
80
butter
churns
rabbit
ears
pedestals
grapes
turned
papers
tees
x
ray
device
marker
however
pinball
stepout
pale
naked
hair
cabinetry
doesn
hanger
chance
super
cool
decorating
bodega
heavy
riest
foundation
yankees
cliffhanging
televisions
lectern
throne
directory
raw
slippers
soaps
wetbar
343
management
travertine
pavers
shining
careful
admire
portico
musical
01
classroom
mechanical
devices
overhang
harbor
orders
paisley
ring
trophy
cris
taller
beverage
chesterfield
carpets
classdoors
electronics
cake
wake
rocker
valet
308
patisserie
yoou
audiovisual
twirly
vented
trellised
covers
bend
audio
visual
elevated
hallwy
crooked
leeds
download
charcoal
ac
fron
jimmy
hendrix
thr
disk
paris
my
dreams
football
fooseball
pac
advancing
filter
natural
liquid
dispensing
pans
temporary
partitions
mostly
separator
stovetops
oudside
hearing
pegs
walnut
numbered
must
marshmallows
hamami
warmer
tol
chartreuse
item
crucifix
screening
lounges
blackets
dim
distressed
pelt
what
multicolored
nesxt
displaying
glassware
less
av
suitcase
pack
font
pond
larg
locked
heart
shapes
shead
progress
complete
backdoor
reads
higher
tress
curvy
lacquer
outer
curious
pasr
george
harrison
self
accessible
kneeling
loves
eta
stockings
swith
thte
socks
induction
stretched
roofed
conditioner
jagged
shades
cordoned
circled
315
pallets
champagne
wired
lying
alaska
welcoming
coaches
snowman
hillside
numerous
trellis
dripping
works
conditioning
hung
acrros
diving
perspective
bring
outide
touch
putting
pug
strauight
backboard
laying
centered
pencil
sala
xvi
wrong
cappuccino
alphabet
wig
upright
curtis
wilson
cost
patha
manel
barriers
canopy
wainscoting
doubled
country
semiround
displays
heiroglypics
stan
sisal
dooorway
straightacross
clearing
nyc
skyline
world
bathrooom
controls
straigh
diadem
freezers
refridgerator
forth
secretary
jugs
teapot
familyroom
tdoor
tripod
ght
continues
ed
wise
access
inner
inches
leftside
lefft
poast
madonna
torso
stiairs
islands
1st
embroidered
layout
sea
shells
choir
numbers
00
excersise
within
chests
ornamental
info
pasts
panty
refrigertor
starburst
atop
test
kithchen
overpass
giraffes
giraffi
alittle
cog
slit
shelved
girls
cherry
patiently
sunburst
decor
size
shovel
optometrist
cock
hottub
running
lone
indicates
tront
bedsrpread
initial
2ft
hieroglyphs
creates
tourists
butterfly
coutch
claw
information
museum
afghan
answering
kitche
dink
mannequin
bonnet
signed
helmet
shaggy
figured
dooryway
taxidermy
purse
handbag
plush
stations
carpert
squiggle
craft
mannequins
manikins
steamroom
mustard
older
stereos
stereo
magenta
doctor
25
horseback
panoramic
checker
abacus
barrels
type
sette
catch
glimpse
twist
told
jug
frist
